//: [Previous](@previous)

import Foundation

// UIKit - это фреймворк, обеспечивающий ключевую инфраструктуру, необходимую для создания и функционирования iOS-приложений. UIKit содержит большое количество объектных типов данных, благодаря которым функционируют приложения, строится их графический интерфейс, обрабатывается анимация и события (например: прикосновение к экрану устройства или получение push-уведомления), расчитывается физическое взаимодействие предметов и многое другое

// UIKit используется только при разработке под iOS. В рамках операционной системы MacOS работает фреймворк AppKit

// SwiftUI - это новая библиотека от Apple, пришедшая на замену UIKit в части касающейся создания графического интерфейса. Таким образом iOS-приложения все еще функционируют на UIKit, но графическая составляющая может быть разработана как средствами UIKit, так и средствами SwiftUI либо при их совместном использовании

// Библиотека SwiftUI предлагает совершенно новый способ создания интерфйса приложений. Основным отличием SwiftUI от UIKit (в части постороения графического интерфейса) является декларативный подход вместо императивного.



//: [Next](@next)
